In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect("InPocket-Database.db")
cur = con.cursor()

In [3]:
query = f"SELECT * FROM transactions"
df = pd.read_sql_query(query, con)

In [4]:
df.head()

,transaction_id,username,statement,transaction_type,description,amount,month,day,year
0,7,sauceboy,Income,Gift,Cashapped from Friend,15.00,9,9,2021
1,8,joe,Expense,Retail,Bought Apple Watch Cover,-19.95,9,11,2021
2,9,joe,Expense,School,App,-1.99,9,11,2021
3,10,joe,Income,Work,Got Paid,231.23,9,11,2021
4,11,joe,Expense,Gift,BROKE,-100.00,9,11,2021

In [ ]:
df['amount'].max()